# Pandas Exercise: Grouping (OCCUPATION FILE)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [4]:
url="https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
data=pd.read_csv(url,sep='|')
data.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 3. Assign it to a variable called users.

In [7]:
users=data
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [9]:
users[['occupation', 'age']].groupby('occupation').mean().head()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [101]:
per=users[['occupation','gender','user_id']].groupby(['occupation','gender']).count()

In [119]:
per1=per.rename(columns={'user_id':'Percentage_Male'})
per2=per1.groupby(level=0).apply(lambda x: x/x.sum() * 100)

In [122]:
per2.loc(axis=0)[slice(None),'M'].sort_values(by='Percentage_Male',ascending=False).head(10)

                      Percentage_Male
occupation    gender
doctor        M            100.000000
engineer      M             97.014925
technician    M             96.296296
retired       M             92.857143
programmer    M             90.909091
executive     M             90.625000
scientist     M             90.322581
entertainment M             88.888889
lawyer        M             83.333333
salesman      M             75.000000

### Step 6. For each occupation, calculate the minimum and maximum ages

In [77]:
users[['occupation', 'age']].groupby('occupation').agg(['max','min']).add_suffix('_age').head()

              age_age
              max_age min_age
occupation
administrator      70      21
artist             48      19
doctor             64      28
educator           63      23
engineer           70      22

### Step 7. For each combination of occupation and gender, calculate the mean age

In [78]:
users[['occupation', 'age','gender']].groupby(['occupation','gender']).mean().head()

                            age
occupation    gender
administrator F       40.638889
              M       37.162791
artist        F       30.307692
              M       32.333333
doctor        M       43.571429

### Step 8.  For each occupation present the percentage of women and men

In [123]:
per=users[['occupation','gender','user_id']].groupby(['occupation','gender']).count()

In [124]:
per3=per.rename(columns={'user_id':'Perctage_M/F'})
per3.groupby(level=0).apply(lambda x: x/x.sum() * 100).head(6)

                      Perctage_M/F
occupation    gender
administrator F          45.569620
              M          54.430380
artist        F          46.428571
              M          53.571429
doctor        M         100.000000
educator      F          27.368421